[{"model": "books.author", "pk": 1, "fields": {"name": "Stephen King", "bio": "Stephen King is the author of more than fifty books, all of them worldwide bestsellers. His recent work includes The Bill Hodges Trilogy, Revival, and Doctor Sleep. His novel 11/22/63 was named a top ten book of 2011 by The New York Times Book Review and won the Los Angeles Times Book Prize for Mystery/Thriller as well as the Best Hardcover Book Award from the International Thriller Writers Association. He is the recipient of the 2003 National Book Foundation Medal for Distinguished Contribution to American Letters. He lives in Bangor, Maine, with his wife, novelist Tabitha King."}}, {"model": "books.author", "pk": 2, "fields": {"name": "F. Scott Fitzgerald", "bio": "F. Scott Fitzgerald was one of the major American writers of the twentieth century -- a figure whose life and works embodied powerful myths about our national dreams and aspirations. Fitzgerald was talented and perceptive, gifted with a lyrical style and a pitch-perfect ear for language. He lived his life as a romantic, equally capable of great dedication to his craft and reckless squandering of his artistic capital."}}, {"model": "books.author", "pk": 3, "fields": {"name": "Chuck Palahniuk", "bio": "Chuck Palahniuk's novels are the bestselling Fight Club, which was made into a film by director David Fincher, Diary, Lullaby, Survivor, Haunted, and Invisible Monsters. Portions of Choke have appeared in Playboy, and Palahniuk's nonfiction work has been published by Gear, Black Book, The Stranger, and the Los Angeles Times. He lives in the Pacific Northwest."}}, {"model": "books.author", "pk": 4, "fields": {"name": "George R.R. Martin", "bio": "George R.R. Martin sold his first story in 1971 and has been writing professionally since then. He spent ten years in Hollywood as a writer-producer, working on The Twilight Zone, Beauty and the Beast, and various feature films and television pilots that were never made. In the mid ‘90s he returned to prose, his first love, and began work on his epic fantasy series, A Song of Ice and Fire. He has been in the Seven Kingdoms ever since. Whenever he’s allowed to leave, he returns to Santa Fe, New Mexico, where he lives with the lovely Parris, and two cats named Augustus and Caligula, who think they run the place."}}, {"model": "books.author", "pk": 5, "fields": {"name": "J. R. R. Tolkien", "bio": "J.R.R. Tolkien (1892.1973), beloved throughout the world as the creator of The Hobbit and The Lord of the Rings, was a professor of Anglo-Saxon at Oxford, a fellow of Pembroke College, and a fellow of Merton College until his retirement in 1959. His chief interest was the linguistic aspects of the early English written tradition, but even as he studied these classics he was creating a set of his own."}}, {"model": "books.author", "pk": 6, "fields": {"name": "George Orwell", "bio": "GEORGE ORWELL (1903-1950) was born in India and served with the Imperial Police in Burma before joining the Republican Army in the Spanish Civil War. Orwell was the author of six novels as well as numerous essays and nonfiction works."}}, {"model": "books.author", "pk": 7, "fields": {"name": "J. K. Rowling", "bio": "J K (Joanne Kathleen) Rowling was born in the summer of 1965 at Yate General Hospital in England and grew up in Chepstow, Gwent where she went to Wyedean Comprehensive. Jo left Chepstow for Exeter University, where she earned a French and Classics degree, and where her course included one year in Paris. As a postgraduate she moved to London to work at Amnesty International, doing research into human rights abuses in Francophone Africa. She started writing the Harry Potter series during a Manchester to London King's Cross train journey, and during the next five years, outlined the plots for each book and began writing the first novel. Jo then moved to northern Portugal, where she taught English as a foreign language."}}, {"model": "books.author", "pk": 8, "fields": {"name": "Harper Lee", "bio": "Harper Lee, known as Nelle, was born in the Alabama town of Monroeville, the youngest of four children of Amasa Coleman Lee and Frances Cunningham Finch Lee. Her father, a former newspaper editor and proprietor, was a lawyer who served on the state legislature from 1926 to 1938. As a child, Lee was a tomboy and a precocious reader, and enjoyed the friendship of her schoolmate and neighbor, the young Truman Capote."}}, {"model": "books.book", "pk": 1, "fields": {"title": "To Kill a Mockingbird", "cover_url": "covers/to-kill-a-mockingbird.jpg", "description": "The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it, To Kill A Mockingbird became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.", "genre": "Classics", "price": 10.99, "publisher": "Harper Perennial Modern Classics", "release_date": "2003-05-23T16:00:00Z", "author": [8]}}, {"model": "books.book", "pk": 2, "fields": {"title": "It", "cover_url": "covers/sk-it.jpeg", "description": "Stephen King’s terrifying, classic #1 New York Times bestseller, “a landmark in American literature” (Chicago Sun-Times)—about seven adults who return to their hometown to confront a nightmare they had first stumbled on as teenagers…an evil without a name: It.\r\n\r\nWelcome to Derry, Maine. It’s a small city, a place as hauntingly familiar as your own hometown. Only in Derry the haunting is real.\r\n\r\nThey were seven teenagers when they first stumbled upon the horror. Now they are grown-up men and women who have gone out into the big world to gain success and happiness. But the promise they made twenty-eight years ago calls them reunite in the same place where, as teenagers, they battled an evil creature that preyed on the city’s children. Now, children are being murdered again and their repressed memories of that terrifying summer return as they prepare to once again battle the monster lurking in Derry’s sewers.", "genre": "Horror", "price": 11.99, "publisher": "Scribner", "release_date": "2016-01-01T17:37:05Z", "author": [1]}}, {"model": "books.book", "pk": 3, "fields": {"title": "Dark Tower", "cover_url": "covers/sk-dark-tower.jpeg", "description": "Some description", "genre": "Fantasy", "price": 12.99, "publisher": "Anchor", "release_date": "2017-10-11T16:00:00Z", "author": [1]}}, {"model": "books.review", "pk": 2, "fields": {"book": 1, "author": null, "rating": 4, "comments": null, "created_at": "2017-10-14T15:12:54.686Z"}}, {"model": "books.review", "pk": 3, "fields": {"book": 1, "author": null, "rating": 3, "comments": null, "created_at": "2017-10-14T15:13:00.686Z"}}, {"model": "books.review", "pk": 4, "fields": {"book": 1, "author": null, "rating": 5, "comments": "I loved re-reading IT all over again. I began remembering as I read and I love how I can always picture in my mind Stephen King books as I read them. the characters are so much fun to learn about as you read the story. So much detail and it makes it even extra special\r\n\r\nNo you do not need to read the book to see the movie however I highly recommend reading this book. It is a wonderfully creepy book to read. Thank you Stephen King: I love your books", "created_at": "2017-10-14T15:13:06.206Z"}}, {"model": "books.review", "pk": 5, "fields": {"book": 2, "author": 2, "rating": 4, "comments": null, "created_at": "2017-10-15T03:30:41.795Z"}}]