[{"model": "books.author", "pk": 1, "fields": {"name": "Stephen King", "bio": "Stephen King is the author of more than fifty books, all of them worldwide bestsellers. His recent work includes The Bill Hodges Trilogy, Revival, and Doctor Sleep. His novel 11/22/63 was named a top ten book of 2011 by The New York Times Book Review and won the Los Angeles Times Book Prize for Mystery/Thriller as well as the Best Hardcover Book Award from the International Thriller Writers Association. He is the recipient of the 2003 National Book Foundation Medal for Distinguished Contribution to American Letters. He lives in Bangor, Maine, with his wife, novelist Tabitha King."}}, {"model": "books.author", "pk": 2, "fields": {"name": "F. Scott Fitzgerald", "bio": "F. Scott Fitzgerald was one of the major American writers of the twentieth century -- a figure whose life and works embodied powerful myths about our national dreams and aspirations. Fitzgerald was talented and perceptive, gifted with a lyrical style and a pitch-perfect ear for language. He lived his life as a romantic, equally capable of great dedication to his craft and reckless squandering of his artistic capital."}}, {"model": "books.author", "pk": 3, "fields": {"name": "Chuck Palahniuk", "bio": "Chuck Palahniuk's novels are the bestselling Fight Club, which was made into a film by director David Fincher, Diary, Lullaby, Survivor, Haunted, and Invisible Monsters. Portions of Choke have appeared in Playboy, and Palahniuk's nonfiction work has been published by Gear, Black Book, The Stranger, and the Los Angeles Times. He lives in the Pacific Northwest."}}, {"model": "books.author", "pk": 4, "fields": {"name": "George R.R. Martin", "bio": "George R.R. Martin sold his first story in 1971 and has been writing professionally since then. He spent ten years in Hollywood as a writer-producer, working on The Twilight Zone, Beauty and the Beast, and various feature films and television pilots that were never made. In the mid ‘90s he returned to prose, his first love, and began work on his epic fantasy series, A Song of Ice and Fire. He has been in the Seven Kingdoms ever since. Whenever he’s allowed to leave, he returns to Santa Fe, New Mexico, where he lives with the lovely Parris, and two cats named Augustus and Caligula, who think they run the place."}}, {"model": "books.author", "pk": 5, "fields": {"name": "J. R. R. Tolkien", "bio": "J.R.R. Tolkien (1892.1973), beloved throughout the world as the creator of The Hobbit and The Lord of the Rings, was a professor of Anglo-Saxon at Oxford, a fellow of Pembroke College, and a fellow of Merton College until his retirement in 1959. His chief interest was the linguistic aspects of the early English written tradition, but even as he studied these classics he was creating a set of his own."}}, {"model": "books.author", "pk": 6, "fields": {"name": "George Orwell", "bio": "GEORGE ORWELL (1903-1950) was born in India and served with the Imperial Police in Burma before joining the Republican Army in the Spanish Civil War. Orwell was the author of six novels as well as numerous essays and nonfiction works."}}, {"model": "books.author", "pk": 7, "fields": {"name": "J. K. Rowling", "bio": "J K (Joanne Kathleen) Rowling was born in the summer of 1965 at Yate General Hospital in England and grew up in Chepstow, Gwent where she went to Wyedean Comprehensive. Jo left Chepstow for Exeter University, where she earned a French and Classics degree, and where her course included one year in Paris. As a postgraduate she moved to London to work at Amnesty International, doing research into human rights abuses in Francophone Africa. She started writing the Harry Potter series during a Manchester to London King's Cross train journey, and during the next five years, outlined the plots for each book and began writing the first novel. Jo then moved to northern Portugal, where she taught English as a foreign language."}}, {"model": "books.author", "pk": 8, "fields": {"name": "Harper Lee", "bio": "Harper Lee, known as Nelle, was born in the Alabama town of Monroeville, the youngest of four children of Amasa Coleman Lee and Frances Cunningham Finch Lee. Her father, a former newspaper editor and proprietor, was a lawyer who served on the state legislature from 1926 to 1938. As a child, Lee was a tomboy and a precocious reader, and enjoyed the friendship of her schoolmate and neighbor, the young Truman Capote."}}, {"model": "books.author", "pk": 9, "fields": {"name": "Dan Brown", "bio": "DAN BROWN is the author of numerous #1 international bestsellers, including The Da Vinci Code, Inferno, The Lost Symbol, Angels & Demons, Deception Point, and Digital Fortress."}}, {"model": "books.author", "pk": 10, "fields": {"name": "Walter Wilson", "bio": "Walter Isaacson, University Professor of History at Tulane, has been CEO of the Aspen Institute, chairman of CNN, and editor of Time magazine. He is the author of Leonardo da Vinci; The Innovators; Steve Jobs; Einstein: His Life and Universe; Benjamin Franklin: An American Life; and Kissinger: A Biography, and the coauthor of The Wise Men: Six Friends and the World They Made. Facebook: Walter Isaacson, Twitter: @WalterIsaacson"}}, {"model": "books.book", "pk": 1, "fields": {"title": "To Kill a Mockingbird", "cover_url": "covers/to-kill-a-mockingbird.jpg", "description": "The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it, To Kill A Mockingbird became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.", "genre": "Classics", "price": 10.99, "publisher": "Harper Perennial Modern Classics", "release_date": "2003-05-23T16:00:00Z", "author": [8]}}, {"model": "books.book", "pk": 2, "fields": {"title": "It", "cover_url": "covers/sk-it.jpeg", "description": "Stephen King’s terrifying, classic #1 New York Times bestseller, “a landmark in American literature” (Chicago Sun-Times)—about seven adults who return to their hometown to confront a nightmare they had first stumbled on as teenagers…an evil without a name: It.\r\n\r\nWelcome to Derry, Maine. It’s a small city, a place as hauntingly familiar as your own hometown. Only in Derry the haunting is real.\r\n\r\nThey were seven teenagers when they first stumbled upon the horror. Now they are grown-up men and women who have gone out into the big world to gain success and happiness. But the promise they made twenty-eight years ago calls them reunite in the same place where, as teenagers, they battled an evil creature that preyed on the city’s children. Now, children are being murdered again and their repressed memories of that terrifying summer return as they prepare to once again battle the monster lurking in Derry’s sewers.", "genre": "Horror", "price": 11.99, "publisher": "Scribner", "release_date": "2016-01-01T17:37:05Z", "author": [1]}}, {"model": "books.book", "pk": 3, "fields": {"title": "The dark tower", "cover_url": "covers/sk-dark-tower.jpeg", "description": "The #1 New York Times best-seller coined Stephen King's greatest literary achievement to date, The Gunslinger is the first volume in his epic Dark Tower Series, soon to be a major motion picture starring Matthew McConaughey and Idris Elba! Originally released in 1982, the story follows Roland of Gilead, the last gunslinger, a loner on a spellbinding journey into good and evil. In his desolate world - which mirrors our own in many frightening ways - Roland tracks The Man in Black, encounters an enticing woman named Alice + begins a friendship with the boy from New York named Jake. Inspired in part by the Robert Browning narrative poem, Childe Roland to the Dark Tower Came The Gunslinger is a thrilling story that will leave you wanting more - and lucky for you, there are 7 more books in the series! Paperback; 2017, Scribner.", "genre": "Horror", "price": 12.89, "publisher": "Scribner", "release_date": "2016-05-03T17:37:05Z", "author": [1]}}, {"model": "books.book", "pk": 4, "fields": {"title": "Sleping Beauties", "cover_url": "covers/sk-sleeping.jpeg", "description": "In this spectacular father/son collaboration, Stephen King and Owen King tell the highest of high-stakes stories: what might happen if women disappeared from the world of men?", "genre": "Fiction", "price": 19.49, "publisher": "Scribner", "release_date": "2017-09-26T17:37:05Z", "author": [1]}}, {"model": "books.book", "pk": 5, "fields": {"title": "Gwendy's Button Box", "cover_url": "covers/sk-gwendys.jpg", "description": "Stephen King teams up with long-time friend and award-winning author Richard Chizmar for the first time in this original, chilling novella that revisits the mysterious town of Castle Rock. There are three ways up to Castle View from the town of Castle Rock: Route 117, Pleasant Road, and the Suicide Stairs. Every day in the summer of 1974, twelve-year-old Gwendy Peterson has taken the stairs, which are held by strong—if time-rusted—iron bolts and zig-zag up the precarious cliffside.  Then one day when Gwendy gets to the top of Castle View, after catching her breath and hearing the shouts of kids on the playground below, a stranger calls to her. There on a bench in the shade sits a man in black jeans, a black coat, and a white shirt unbuttoned at the top. On his head is a small, neat black hat. The time will come when Gwendy has nightmares about that hat.", "genre": "Fiction", "price": 17.14, "publisher": "Scribner", "release_date": "2017-05-16T17:37:05Z", "author": [1]}}, {"model": "books.book", "pk": 6, "fields": {"title": "Origin", "cover_url": "origin.jpg", "description": "Robert Langdon, Harvard professor of symbology and religious iconology, arrives at the ultramodern Guggenheim Museum Bilbao to attend a major announcement—the unveiling of a discovery that “will change the face of science forever.” The evening’s host is Edmond Kirsch, a forty-year-old billionaire and futurist whose dazzling high-tech inventions and audacious predictions have made him a renowned global figure. Kirsch, who was one of Langdon’s first students at Harvard two decades earlier, is about to reveal an astonishing breakthrough . . . one that will answer two of the fundamental questions of human existence.", "genre": "Drama", "price": 17.97, "publisher": "Knopf Doubleday Publishing Group", "release_date": "2017-10-03T20:52:12Z", "author": [9]}}, {"model": "books.review", "pk": 1, "fields": {"book": 1, "author": 1, "rating": 4, "created_at": "2017-10-14T15:12:47.484Z"}}, {"model": "books.review", "pk": 2, "fields": {"book": 1, "author": null, "rating": 4, "created_at": "2017-10-14T15:12:54.686Z"}}, {"model": "books.review", "pk": 3, "fields": {"book": 1, "author": null, "rating": 3, "created_at": "2017-10-14T15:13:00.686Z"}}, {"model": "books.review", "pk": 4, "fields": {"book": 1, "author": null, "rating": 5, "created_at": "2017-10-14T15:13:06.206Z"}}]